Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
  valvestate = A_INIT;

  // Interval in microsecs
  if (ITimer0.attachInterruptInterval(TIMER0_INTERVAL_MS * 1000, TimerHandler0))
  {
    #ifdef motDebug 
        COMM_DBG.print(F("Starting ITimer0 OK, millis() = ")); COMM_DBG.println(millis());
    #endif
  }
  else {
    #ifdef motDebug
      COMM_DBG.println(F("Can't set ITimer0. Select another freq. or timer"));
    #endif
  }

 

  return 0;
}


void valve_loop () {
  
  byte temp = 0;
  //byte stateresult;

  //static int cyclecnt = 0;
  //static int debouncecnt = 0;
  byte result = 0;

  static byte pos_change = 0;

  static unsigned int closing_count = 0;  
  static unsigned int opening_count = 0;
  static unsigned int deadzone_count = 0;

  static int idlecurrenttimer = 0;
  
  static unsigned int scaler = 0;
  static int valveindex = 0;

  static int waittimer = 0;
  static int psuofftimer = 0;
  static int locktimer = 0;

  static enum ASTATE oldvalvestate;

  if(waittimer) waittimer--;

  oldvalvestate = valvestate;

  switch (valvestate) {
    case A_INIT:  
                  if ( motorcycle(0, CMD_M_NOTHING) == M_RES_IDLE ) {                    
                     #ifdef motDebug
                        COMM_DBG.println("A: init ready");
                     #endif
                     valvestate = A_IDLE;
                     
                     //valveindex = 0;                     
                     //myvalves[valveindex].scaler = 130;
                     //myvalves[valveindex].target_position = 0;    

                     valveindex = 255;
                    
                  }
                  break;

    case A_IDLE:  
                  valveindex = valvenr;
                  if (command == CMD_A_OPEN) {
                    #ifdef motDebug                    
                      COMM_DBG.print("A: cmd open for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_CLOSE) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd close for valve ");                  
                      COMM_DBG.println(valveindex, 10);                                        
                    #endif
                    valvestate = A_CLOSE1;  
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_OPEN_END) {  
                    #ifdef motDebug                  
                      COMM_DBG.print("A: cmd open to endstop for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_CLOSE_END) {   
                    #ifdef motDebug                 
                      COMM_DBG.print("A: cmd close to endstop for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_CLOSE1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_LEARN) {
                    #ifdef motDebug                    
                      COMM_DBG.print("A: cmd learn for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_LEARN1;
                    PSU_ON(); 
                    psuofftimer = 0;
                    waittimer = 50; 
                    calibRetries = 0;
                    myvalvemots[valveindex].calibRetries=0;
                  }
                  else if (command == CMD_A_TEST) { 
                    #ifdef motDebug                   
                      COMM_DBG.print("A: cmd test valve ");                  
                      COMM_DBG.println(valveindex, 10);  
                    #endif                  
                    valvestate = A_TEST;
                    PSU_ON();
                    waittimer = 100;
                    psuofftimer = 0;
                  }
                  else {
                    valvestate = A_IDLE;

                    // switch off PSU after some inactive (idle) time
                    psuofftimer++;
                    if(psuofftimer > 1500) {      // 15 s
                      psuofftimer = 0;
                      PSU_OFF();
                      MUX_OFF();
                    }  
                  }           

                  // decrement learning counter
                  if (!myvalvemots[valveindex].calibration) {
                    if(valvestate == A_OPEN1 || valvestate == A_CLOSE1) {
                      if(myvalves[valveindex].learn_movements) {
                        myvalves[valveindex].learn_movements--;
                      }
                      myvalves[valveindex].movements++;
                    }
                  }

                  // pause temperature measurement to avoid ADC interference
                  if(valvestate != A_IDLE) {
                    temp_command(TEMP_CMD_LOCK);
                    locktimer = 0;
                  }
                  else {
                    if (locktimer<50) locktimer++;
                    else temp_command(TEMP_CMD_UNLOCK);                      
                  }            
               
                  // // measure idle current for offset (drift) compensation
                  // if (idlecurrenttimer < 10) 
                  // {
                  //   idlecurrenttimer++;
                  // }
                  // else
                  // {                      
                  //   idlecurrenttimer = 0;
                  //   idlecurrent = (unsigned int) ((uint32_t) (analogRead(ANINREFHALF) * 200 + (uint32_t) idlecurrent_old * 800) / 1000);
                  //   idlecurrent_old = idlecurrent;
                  // }
                 

                  command = '\0';       // clear command for next loop call, prevents reevaluating
                  break;

