Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
  // static int currentbound_low;              // lower current limit for detection of end stop
  // static int currentbound_high;             // upper current limit for detection of end stop


  static unsigned int meancurrent_cnt = 0;      // counts meancurrent values
  static long meancurrent_mem = 0;              // memory for meancurrent values
  byte result = 0;

  // quickpass for isr state switching
  if(cmd==CMD_M_STOP_ISR) {
    motorstate = M_STOP_ISR;
    //result = M_RES_STOP_ISR;
  }
  //else {
    switch (motorstate) {
      case M_INIT:  MUX_OFF();         // relay MUX off
                    ena_motor(0, 0);
                    DIR_OFF();         // direction off
  
                    motorstate = M_IDLE;
                    isr_turning = 0;
                    isr_counter = 0;
                    isr_target = 0;
                    result = M_RES_INIT;
                    isr_timer_go = 0;
                    isr_timer_fin = 0;
  
                    break;
  
      case M_IDLE:
                    if (cmd == CMD_M_OPEN) {
                      motorstate = M_OPEN;  
                      result = M_RES_OPENS;
                    }
                    else if (cmd == CMD_M_CLOSE) {
                      motorstate = M_CLOSE;  
                      result = M_RES_CLOSES;
                    }
                    else if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;
                      result = M_RES_STOP;  
                    }
                    else if (cmd == CMD_M_TEST) {
                      motorstate = M_TESTPREP;
                      result = M_RES_TEST;  
                    }
                    else {
                      motorstate = M_IDLE;  
                      result = M_RES_IDLE;
                    }
  
                    // correct motor nr?
                    if (motorstate != M_IDLE && mvalvenr > (int) ACTUATOR_COUNT) {
                      motorstate = M_IDLE;
                      result = M_RES_IDLE;
                    }

                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    
                    break;
      
      case M_OPEN:  
                    #ifdef motDebug
                      COMM_DBG.println("M: state open");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN);
                    //digitalWrite(POWER_ENA, 0);   // enable PSU for vlaves   
                    //ena_motor(valvenr, 1);  
  
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;                  
                    result = M_RES_OPENS;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
                    
                    break;
                    
      case M_CLOSE:
                    #ifdef motDebug
                      COMM_DBG.println("M: state close");                                 
                    #endif
                    set_motor(mvalvenr, DIR_CLOSE);
                    //digitalWrite(POWER_ENA, 0);   // enable PSU for vlaves
                    //ena_motor(mvalvenr, 1);
                      
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;
                    result = M_RES_CLOSES;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
  
                    break;
                  
      case M_TURNON:
                    isr_turning = 1;
                    result = M_RES_TURNING;
                    isr_timer_go = 1;

                    currentbound_low = (int) (m_meancurrent) * -1 * (int) (currentbound_low_fac); //10 * -3;
                    currentbound_high = (int) (m_meancurrent) * (int) (currentbound_high_fac); //10 * 3;

                    meancurrent_mem = 0;
                    meancurrent_cnt = 0;

                    analog_current_old = 0;
                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    normalcurrcnt = 0;

                    // check if pwm is finished
                    if(isr_timer_fin) {
                      motorstate = M_TURNING;
                      isr_timer_fin = 0;
                      isr_timer_go = 0;
                    }

                    break;

      case M_TURNING:
                    //isr_turning = 1;
                    result = M_RES_TURNING;
    
                    if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;  
                    }
                    cyclecnt++;
                                
                    if(debouncecnt<255) debouncecnt++;
                    if(testcnt<255) testcnt++;

                    if (debouncecnt > 3) {
                    //  if(1) {

                      // // calc current in 1/10 mA
                      // analog_current = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);
                      // // COMM_DBG.print(analog_current,DEC);
                      // // COMM_DBG.print(" ");
                      // // COMM_DBG.print(idlecurrent,DEC);
                      // // COMM_DBG.println(" analog_current");

                      // // filter
                      // analog_current = (int) (((int32_t) analog_current_old * 800 + (int32_t) analog_current * 200) / 1000);
                      // analog_current_old = analog_current;

                      // current_mA = analog_current;

                      // if (testcnt > 40) {
                      //   testcnt = 0;
                      //   COMM_DBG.print("A0 current ");
                      //   COMM_DBG.print(analog_current,DEC);
                      //   COMM_DBG.print(" idle ");
                      //   COMM_DBG.print(idlecurrent,DEC);
                      //   COMM_DBG.println(" digits");
                      // }

                      // // under current detection
                      // if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      // {
                      //   undercurrcnt++;
                      //   if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                      //   {
                      //     undercurrcnt = 0;
                      //     motorstate = M_UNDERCURR;
                      //   }                        
                      // }

                      // // overcurrent detection
                      // if(current_mA > currentbound_high || current_mA < currentbound_low ||  
                      //    current_mA > 1000 || current_mA < -1000)         // safety mechanism, limit at +- 100 mA
                      // {
                      //   overcurrcnt++;
                      //   if (overcurrcnt > TIMEOUT_OVERCURRENT)
                      //   {
                      //     //motorstate = M_STOP;                          
                      //     detachInterrupt(digitalPinToInterrupt(REVINPIN)); 
                      //     overcurrcnt = 0;
                      //     motorstate = M_IDLE;
                      //     result = M_RES_ENDSTOP;
                      //     ena_motor(0, 0);
                      //     isr_turning = 0;
                      //     //MUX_OFF();

                      //     if (meancurrent_cnt > 0) m_meancurrent = abs(meancurrent_mem) / meancurrent_cnt / 10;
                      //     else m_meancurrent = 0;
                      //     #ifdef motDebug
                      //       COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                      //       //#warning fixme
                      //       //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA,10); COMM_DBG.println(" 1/10 mA");
                      //       COMM_DBG.print("M: Cnt:     "); COMM_DBG.println(isr_counter, DEC);                                 
                      //       COMM_DBG.println("M: Autostop, reached end stop");
                      //     #endif
                      //   }
                      // }

                      
                      // overcurrent detection
                      if(isr_overcurrentevent)         
                      {                        
                        // overcurrcnt++;
                        // if (overcurrcnt > TIMEOUT_OVERCURRENT)
                        // {
                          //motorstate = M_STOP;                          
                          detachInterrupt(digitalPinToInterrupt(REVINPIN)); 
                          // overcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          ena_motor(0, 0);
                          isr_turning = 0;
                          isr_overcurrentevent = 0;
                          //MUX_OFF();

                          if (meancurrent_cnt > 0) m_meancurrent = abs(meancurrent_mem) / meancurrent_cnt / 10;
                          else m_meancurrent = 0;
                          #ifdef motDebug
                            COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                            //#warning fixme
                            //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA,10); COMM_DBG.println(" 1/10 mA");
                            COMM_DBG.print("M: Cnt:     "); COMM_DBG.println(isr_counter, DEC);                                 
                            COMM_DBG.println("M: Autostop, reached end stop");
                          #endif
                        // }
                      }

                       // under current detection
                      else if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      {
                        undercurrcnt++;
                        if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                        {
                          undercurrcnt = 0;
                          motorstate = M_UNDERCURR;
                        }                        
                      }

                      // normal turning
                      else  {
                        //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                        normalcurrcnt++;
                        if(normalcurrcnt > TIMEOUT_NORMALCURRENT) {
                          #ifdef motDebug          
                            COMM_DBG.println("M: normal turning timeout");            
                          #endif
                          
                          detachInterrupt(digitalPinToInterrupt(REVINPIN)); 
                          normalcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ERROR;
                          ena_motor(0, 0);
                          isr_turning = 0;    
                        }                
                      }
                      //cyclecnt=0;

                      

