Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
                      // testmode
                      // output position and current
                      if(testmode) {
                        #ifdef motDebug
                          COMM_DBG.print("tm;"); 
                          COMM_DBG.print(current_mA,10); 
                          COMM_DBG.print(";"); 
                          COMM_DBG.println(isr_counter);
                        #endif

                      }
                    }

                    if (debouncecnt > 50 && cyclecnt > 50) {
                      cyclecnt=0;
                      #ifdef motDebug
                        COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                        //#warning fixme
                        //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA, 10); COMM_DBG.println(" 1/10 mA");
                      #endif
                      meancurrent_mem += current_mA;
                      meancurrent_cnt++;
                    }
                    break;
                      
      case M_STOP:         
                    //detachInterrupt(digitalPinToInterrupt(REVINPIN));
                    #ifdef motDebug
                      COMM_DBG.println("M: state stop");    
                    #endif                                  
                    ena_motor(0, 0);
                    //digitalWrite(POWER_ENA, 1);   // disable PSU for vlaves   
                    isr_turning = 0;
                    //MUX_OFF();
                    #ifdef motDebug
                      COMM_DBG.print("M: Cnt: ");  
                      COMM_DBG.println(isr_counter, DEC);                                 
                    #endif
                    motorstate = M_IDLE;
                    result = M_RES_STOP;                  
                    
                    break;

      case M_STOP_ISR: 
                    #ifdef motDebug
                      COMM_DBG.println("M: target stop");  
                    #endif
                    motorstate = M_STOP;
                    result = M_RES_STOP_ISR;  
                    break;

      case M_UNDERCURR:         
                    detachInterrupt(digitalPinToInterrupt(REVINPIN));
                    #ifdef motDebug
                      COMM_DBG.println("M: state undercurrent detected, stopped");    
                    #endif                                  
                    ena_motor(0, 0);
                    //digitalWrite(POWER_ENA, 1);   // disable PSU for vlaves 
                    isr_turning = 0;
                    //MUX_OFF();
                    
                    motorstate = M_IDLE;
                    result = M_RES_NOCURRENT;                  
                    
                    break;

      case M_TESTPREP:
                    #ifdef motDebug
                      COMM_DBG.println("M: test prep");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN); 
                    ena_motor(mvalvenr, 1);                 
                
                    cyclecnt = 0;
                    undercurrcnt = 0;
                    normalcurrcnt = 0;
                    overcurrcnt=0;
                    debouncecnt = 0;

                    analog_current_old = 0;
                    analog_current = 0;

                    motorstate = M_TEST;
                    result = M_RES_TEST;                    

                    break;

      case M_TEST:
                    #ifdef motDebug
                      COMM_DBG.print("M: testing"); 
                    #endif
                    result = M_RES_TEST;
    
                    // // calc current in 1/10 mA
                    // analog_current = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);

                    // analog_current = (int) (((int32_t) analog_current_old * 800 + (int32_t) analog_current * 200) / 1000);
                    // analog_current_old = analog_current;

                    // current_mA = analog_current;
                    #ifdef motDebug
                      COMM_DBG.print(" - current: ");
                      COMM_DBG.println (analog_current,DEC);
                    #endif
                    if(debouncecnt<255) debouncecnt++;

                    if(debouncecnt>7) {

                      // under current detection
                      if(analog_current < THRESHOLD_UNDERCURRENT && analog_current > -THRESHOLD_UNDERCURRENT) 
                      {
                        undercurrcnt++;
                        if (undercurrcnt > TIMEOUT_UNDERCURRENTTEST)
                        {
                          #ifdef motDebug
                            COMM_DBG.println("test: undercurrent!");
                          #endif
                          undercurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_NOCURRENT;
                          ena_motor(0, 0);
                        }                        
                      }

                      // overcurrent detection
                                        // overcurrent detection
                      else if(isr_overcurrentevent)                              
                      //else if(current_mA > currentbound_high || current_mA < currentbound_low ||  
                      //  current_mA > 1000 || current_mA < -1000)         // safety mechanism, limit at +- 100 mA
                      {
                        isr_overcurrentevent = 0;
                        // overcurrcnt++;
                        // if (overcurrcnt > TIMEOUT_OVERCURRENT)
                        // {
                          #ifdef motDebug
                            COMM_DBG.println("test: overcurrent!");
                          #endif
                          //overcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          ena_motor(0, 0);
                        
                        // }
                      }

                      // normal turning
                      else  {
                        normalcurrcnt++;
                        if(normalcurrcnt > 5) {
                          #ifdef motDebug          
                            COMM_DBG.println("test: normal turning!");            
                          #endif
                          motorstate = M_IDLE;
                          result = M_RES_OPENS;
                          ena_motor(0, 0);      
                        }                
                      }
                    }

                    break;
                    
      default:      motorstate = M_IDLE;
                    result = M_RES_IDLE;
                    break;
    }  

  //}
  return result;
}


// sets direction and mux relay
void set_motor (int smvalvenr, int dir) {

  if (smvalvenr % 2) { MUX_OFF(); }
  else { MUX_ON(); }
  delay(50); // wait for relay settling
  
  if (dir == DIR_OPEN) { DIR_OFF(); } 
  else { DIR_ON(); }
}


// enables motor 
void ena_motor (int emvalvenr, int state) {

  if (state == 0) { 
    ENA0_OFF(); ENA1_OFF(); ENA2_OFF(); ENA3_OFF(); ENA4_OFF(); ENA5_OFF(); 
  }
  else {
    if (emvalvenr == 0 || emvalvenr == 1) { ENA0_ON(); }
    else if (emvalvenr == 2 || emvalvenr == 3) { ENA1_ON(); }
    else if (emvalvenr == 4 || emvalvenr == 5) { ENA2_ON(); }
    else if (emvalvenr == 6 || emvalvenr == 7) { ENA3_ON(); }
    else if (emvalvenr == 8 || emvalvenr == 9) { ENA4_ON(); }
    else if (emvalvenr == 10 || emvalvenr == 11) { ENA5_ON(); }
  }
}


